Revit 2026 API

# CurveLoopCreateViaTransform Method

---

Creates a new curve loop as a transformed copy of the input curve loop.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static CurveLoop CreateViaTransform(
	CurveLoop curveLoop,
	Transform transform
)
```
```vb
Public Shared Function CreateViaTransform (
	curveLoop As CurveLoop,
	transform As Transform
) As CurveLoop
```
```cpp
public:
static CurveLoop^ CreateViaTransform(
	CurveLoop^ curveLoop,
	Transform^ transform
)
```
```fsharp
static member CreateViaTransform :
        curveLoop : CurveLoop *
        transform : Transform -> CurveLoop
```

#### Parameters

curveLoop CurveLoop
     The input curve loop.
transform Transform
     The transformation.

#### Return Value

CurveLoop The new curve loop.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | transform is not conformal. -or- transform has a scale that is negative or zero. |

The newly created CurveLoop is guaranteed to be valid with all consituent curves contiguous (assuming that the curves were contiguous in the input curve loop).

#### Reference

CurveLoop Class

Autodesk.Revit.DB Namespace